cask_args appdir: "/Applications"
cask "clashx"
brew "mas"

# Taps

tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "d12frosted/emacs-plus"

# Packages

## Apps

brew "d12frosted/emacs-plus/emacs-plus", args: ["HEAD", "without-spacemacs-icon"]
brew "emacs"
brew "vim"
brew "aspell"
brew "aria2"
brew "ffmpeg"
brew "ghq"
brew "gnupg"
brew "graphviz"
brew "mosh"
brew "mtr"
brew "ncdu"
cask "java"
brew "plantuml"
brew "ripgrep"
brew "stow"
brew "telnet"
brew "tmux"
brew "tree"
brew "wget"
brew "youtube-dl"
brew "multimarkdown"

# Casks

cask "anki"
cask "bartender"
cask "nvalt"
cask "devonthink-pro"
cask "iina"
cask "iterm2"
cask "spotify"
cask "xiami"
cask "spectacle"
cask "mailmate"
cask "dropbox"
cask "launchbar"
cask "skim"
cask "lyricsx"

# Mac Apple Store

mas "1Password", id: 443987910
mas "Xcode", id: 497799835
mas "2Do", id: 477670270
mas "Reeder", id: 880001334
mas "Clearview", id: 557090104
mas "Lighten", id: 1206278328
mas "WeChat", id: 836500024
mas "Tweetbot", id: 557168941
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Keynote", id: 409183694
mas "Marked 2", id: 890031187
mas "NepTunes", id: 1006739057

# Devel

brew "openssl"
brew "autoconf"
brew "automake"
brew "readline"
brew "bash"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "cppcheck"
brew "gawk"
brew "gnu-sed"
brew "grep"
# brew "ctags", args: ["HEAD"]
brew "dep"
brew "diff-so-fancy"
brew "fd"
brew "fzy"
brew "git"
brew "git-extras"
brew "global", args: ["with-ctags", "with-pygments"]
brew "goenv"
brew "hadolint"
brew "jsonlint"
brew "pyenv"
brew "rbenv"
brew "shellcheck"
brew "zplug"
brew "zsh"

